
## Plan Result

[CI link](https://github.com/koyashiro/infra/actions/runs/8724711769)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.txt_test


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.txt_test will be created
  + resource "cloudflare_record" "txt_test" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "test-name"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "test-value"
      + zone_id         = "***"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":142,"Program":"tfcmt","SHA1":"39f5b807081baf913b9792293df0acbc21f032d4","Vars":{},"WorkflowName":"terraform"} -->